---
kind: property
id: P:Autodesk.Revit.DB.MeshFromGeometryOperationResult.IsMeshAvailable
source: html/9d587518-ed0c-5199-47b3-2f3c0fa69cb8.htm
---
# Autodesk.Revit.DB.MeshFromGeometryOperationResult.IsMeshAvailable Property

Shows whether the result still contains the mesh
 which was constructed, if any, or whether it has been
 relinquished by 'getMesh'.
 The former is true, the later is false.

## Syntax (C#)
```csharp
public bool IsMeshAvailable { get; }
```